<?php
/**
 * Created by PhpStorm.
 * User: smallzz
 * Date: 2018/1/25
 * Time: 下午3:09
 */
#语音推荐
return [
    '祝爸爸妈妈身体健康万事如意',
    '祝父母生日快乐',
    '希望儿子生日快乐',
    '祝爷爷奶奶身体健康万事如意',
    '祝南瓜同学结婚快乐早生贵子',
    '祝小李同学考试顺利',
    '愿你有酒有肉有姑娘，能贫能笑能干架，此生纵情豁达',
    '愿贪吃不胖，愿长生不老，愿美梦不空，愿深情不负',
    '希望你这一年比上一年过得好一点。希望你好的这部分有一点是因为我',
    '新年好，旧年也好，与你结缘最好',
    '新的一年，愿少年纵横山河，意气风发拓功名',
    '新的一年，愿情人携手相将，结尽同心缔尽缘',
    '愿生活里有热汤和甜食，背包里有书本和远方',
    '愿一切困难都能云淡风轻，每身孤独都拥抱共鸣',
    '长夜里总有梦想发亮，秋收春耕',
    '人海中常有良友相伴，长乐未央',
    '所求皆如愿，所行化坦途，多喜乐，长安宁',
    '我考虑过了，如果到了十二点，我注定会对你说那三个字，那我为何不早点说：新年好',
    '没有夸张的祝福语，没有华丽的台词，祝你新年快乐',
    '新的一年，祝我们都还在',
];