<?php
/**
 * Created by PhpStorm.
 * User: dongmingcui
 * Date: 2017/11/13
 * Time: 下午3:54
 */

/** 公用代码 **/
$commonCode = [
    10 => '参数不能为空',
];

/** api代码 **/
$apiCode = [
    /** api公用 **/
    99  => '友情提醒',
    100 => '添加成功',
    101 => '修改成功',
    102 => '获取成功',
    103 => '删除成功',
    104 => '删除失败',
    105 => '获取失败',
    106 => '添加失败',
    107 => '修改失败',
    108 => '提交成功',
    109 => '请求成功',
    110 => '请求失败',

    /** api用户账号相关 **/
    1000 => '账号或密码错误',
    1001 => '注册失败',
    1002 => '只允许一个设备登录',
    1003 => '登录失效',
    1004 => '请登录后操作',
    1005 => '当前用户已在其他设备登陆',
    1006 => '未绑定手机',
    /** api用户信息相关 **/
    1100 => '',
    1101 => '',
    1102 => '',
    1103 => '',

    /** 验证码相关 **/
    300 => '验证成功',
    301 => '验证码错误',


    /** 小程序user **/
    1200 => '用户信息获取失败',
    1201 => '用户信息保存失败',
    1202 => '用户信息保存成功',

    /** 小程序语音 **/
    1300 => '换个姿势再试',
    1301 => '换个姿势再试',
    1302 => '再接再厉',
    1303 => '红包领取失败',
    1304 => '红包已被抢完了',
    1305 => '成功抢到红包',
    1316 => '已经领取过此红包',
    1306 => '微信支付',
    1307 => '余额支付',
    1308 => '你设置的口令中包含敏感词,请检测修改,谢谢',
    1309 => '红包已过期',

    /** 小程序二维码**/
    1350 => '二维码生成失败',
    1351 => '二维码生成完毕',

    /** qq music **/
    1400 => '音乐列表获取成功',
    1401 => '音乐列表获取失败',

    /** 语音大厅 **/
    1600 => '',
    1601 => '已经在大厅',
    1602 => '分享大厅失败',


    /** 卡劵 **/
    1700 => '',
    1701 => '卡劵状态异常',
    1702 => '卡劵使用成功',
    1703 => 'code解码失败',
    1704 => '领取卡劵失败',
    1705 => '领取卡劵成功',
    /** 小游戏 **/
    1800 => '金币不足',
    1801 => '押注已结束',
    1802 => '押注成功',
    1803 => '押注失败',
    1804 => '押注金额不符合',
    1805 => '押注金额与发起金额不符合',
    1806 => '押注金额与发起金额不符合',
    1807 => '请勿重复签到',
    1808 => '签到成功',
    1809 => '已经参与过了',
    1810 => '记录不存在',
    1811 => '游戏已结束',
    1812 => '金额错误',
    1813 => '余额不足',
    1814 => '用户信息错误',

];

/** backend代码 */
$backendCode = [

    /** 后台公用 **/
    200 => '添加成功',
    201 => '修改成功',
    202 => '获取成功',
    203 => '删除成功',
    204 => '删除失败',
    205 => '获取失败',
    206 => '添加失败',
    207 => '修改失败',

    /** 后台用户账号相关 **/
    2000 => '账号或密码错误',
    2001 => '注册失败',
    2002 => '账号已经注册',
    2003 => '登录失败',

];

return $commonCode + $backendCode + $apiCode;