<?php
/**
 * Created by PhpStorm.
 * User: smallzz
 * Date: 2018/1/10
 * Time: 下午2:41
 */
return [
    '黑化肥发灰会挥发',
    '灰化肥挥发会发黑',
    '刘娘年年恋牛郎',
    '郎念娘来娘恋郎',
    '老龙恼怒闹老农',
    '老农怒恼闹老龙',
    '农怒龙恼龙更怒',
    '龙恼农怒龙怕农',
    '汤上塔塔滑汤汤烫塔',
    '隔着窗户撕字纸撕了字纸吃柿子',
    '石狮寺有四十四只石狮子',
    '门上吊刀刀倒吊着',
    '八百标兵奔北坡',
    '炮兵并排北边跑',
    '炮兵怕把标兵碰',
    '标兵怕碰炮兵炮',
    '黑肥混灰肥灰肥混黑肥',
    '黑肥混灰肥黑肥灰又黑',
    '黑肥混灰肥肥比黑肥灰',
    '灰肥混黑肥肥比灰肥黑',
    '新年大吉',
    '新年快乐',
    '我喜欢你',
    '红鲤鱼与绿鲤鱼与驴',
    '恭喜发财大吉大利',
    '牛郎牛年恋刘娘',
    '谢谢老板',
    '红鸡公尾巴灰灰鸡公尾巴红',
];